Revit 2024 API
ExternalServiceOptions.Dispose Method
Releases all resources used by the ExternalServiceOptions
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
ExternalServiceOptions Class
Autodesk.Revit.DB.ExternalService Namespace